** Animation names and generating their Adler32 hashes

If you need to refer to  an animation directly by name, the animations are
referred to by the engine by their Adler32  hash, so you might want to add a new
definition for that on ~player.c~.

The names used on tags are always converted to uppercase, with no spaces.

To calculate the Adler32 hash for a string, one may use Zlib through Python.

Here's a tool to generate hash definitions for some animations.

#+begin_src python :results output
import zlib

names = [
    "STOPPED",
    "IDLE",
    "WALKING",
    "RUNNING",
    "ROLLING",
    "SKIDDING",
    "PEELOUT",
    "PUSHING",
    "CROUCHDOWN",
    "LOOKUP",
    "SPRING",
    "HURT",
    "DEATH",
    "DROWN",
    "GASP",
    "WATERWALK",
    "DROP",
    "BALANCELIGHT",
    "BALANCEHEAVY",
    "TAILIDLE",
    "TAILMOVE",
]

def get_hash(name):
    hash = zlib.adler32(str.encode(name))
    return f"0x{hash:08x}"

def print_hashes(names):
    for name in names:
        hash = get_hash(name)
        print(f"#define ANIM_{name:16} {hash}")

print_hashes(names)
#+end_src

#+RESULTS:
#+begin_example
#define ANIM_STOPPED          0x08cd0220
#define ANIM_IDLE             0x02d1011f
#define ANIM_WALKING          0x0854020e
#define ANIM_RUNNING          0x08bf0222
#define ANIM_ROLLING          0x08890218
#define ANIM_SKIDDING         0x0a85024e
#define ANIM_PEELOUT          0x0849021f
#define ANIM_PUSHING          0x08b2021f
#define ANIM_CROUCHDOWN       0x104802fd
#define ANIM_LOOKUP           0x067001db
#define ANIM_SPRING           0x068e01d4
#define ANIM_HURT             0x031b0144
#define ANIM_DEATH            0x04200167
#define ANIM_DROWN            0x048a018b
#define ANIM_GASP             0x02d9012c
#define ANIM_WATERWALK        0x0da602b3
#define ANIM_DROP             0x02f80136
#define ANIM_BALANCELIGHT     0x156c035f
#define ANIM_BALANCEHEAVY     0x15570364
#define ANIM_TAILIDLE         0x0a6e0249
#define ANIM_TAILMOVE         0x0ab30262
#+end_example

